app/views/listings/show.html.erb

  <p>
    <%= Listing.find(bid.buyer_listing_id).account.username + " offers " + Listing.find(bid.buyer_listing_id).name %>
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]