app/controllers/accounts_controller.rb

  def create
    @account = Account.new(account_params(:username, :email, :password, :avatar))
    if @account.save
---
INSERT INTO "accounts" ("username", "password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def show
    @account = Account.find(params[:id])
    @listings = @account.listings.all.order(created_at: :desc)
    @bids = Bid.where('seller_listing_id = ?', @account.id)
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT "listings".* FROM "listings" WHERE "listings"."account_id" = $1  [["account_id", 18]]