app/controllers/bids_controller.rb

INSERT INTO "bids" ("buyer_listing_id", "seller_listing_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["buyer_listing_id", 30], ["seller_listing_id", 1], ["created_at", 2017-03-14 21:25:05 UTC], ["updated_at", 2017-03-14 21:25:05 UTC]]
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
---
  def create
    @bid = Bid.create(bid_params(:buyer_listing_id, :seller_listing_id))
   	@listing = Listing.find(params[:bid][:seller_listing_id])