app/controllers/listings_controller.rb

	def new
		@listing = Listing.new
    @bid = Bid.new
    @account = Account.find(session[:account_id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]

	def create
		@listing = Listing.new(listing_params(:name, :description, :account_id, :photo))
		if @listing.valid?
			@listing.save
---
INSERT INTO "listings" ("name", "description", "account_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Burrito"], ["description", "Used"], ["account_id", 20], ["created_at", 2017-03-15 13:51:23 UTC], ["updated_at", 2017-03-15 13:51:23 UTC]]

	def show
	    @bids = Bid.where(seller_listing_id: @listing.id)
---
SELECT "bids".* FROM "bids" WHERE "bids"."seller_listing_id" = $1  [["seller_listing_id", 30]]

	def index
		@listings = Listing.search(params[:search])
---
SELECT "listings".* FROM "listings" WHERE (description like '%%' or name like '%%')

	def accept
		@seller_listing = Listing.find_by(id: params[:seller_listing_id])
		@seller = Listing.find(params[:seller_listing_id]).account.id

		@buyer_listing = Listing.find_by(id: params[:buyer_listing_id])
		@buyer = Listing.find(params[:buyer_listing_id]).account.id

		@buyer_listing.update(account_id: @seller)
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
UPDATE "listings" SET "account_id" = $1, "updated_at" = $2 WHERE "listings"."id" = $3  [["account_id", 18], ["updated_at", 2017-03-14 19:09:29 UTC], ["id", 30]]

		def find_listing
			@listing = Listing.where(id: params[:id])[0]
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]

		def find_account
			if @listing
				@account = Account.find(@listing.account_id)
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]