app/controllers/sessions_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."username" = $1 LIMIT $2  [["username", "testuser"], ["LIMIT", 1]]
---
  def create
    @account = Account.find_by(account_params(:username))