app/controllers/welcome_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
  def index
    if logged_in?
      @account = Account.find(session[:account_id])