app/views/accounts/show.html.erb

        <td>
        <% listing=Listing.find(bid.seller_listing_id)%>
---
SELECT "listings".* FROM "listings" WHERE "listings"."account_id" = $1  [["account_id", 18]]